# ab=['aza','kany','eliza',94,0,['mama']]
# print(a.index)
# print(a[3])
# start=0
# stop=5
# step=3

# print(a[2:5:2])


# a=[]
# a.append('kanika')
# a.append('eliza')
# a.append('azamat')
# name=input('введите имя:\n>>')
# a.append(name)
# print(a)

# a=['kanika', 'eliza', 'azamat', 'iilon']
# a.remove('kanika')
# a.pop(3)
# print(a)
# print(a.count('kanika'))
# a.extend(ab)
# print(a)


a=('kanika', 'eliza', 'azamat', 'iilon','sjdfh','sjkdhfkjs','yigef','kanika', 'eliza', 'azamat', 'iilon')
print(a[:len(a)//2])

# a=[]
# l=('kani','eliza')
# b=('lol','lal')
# j=('slice','koko')
# d=('pop','list')
# m=('mama','papa')

# a.append(l)
# a.append(b)
# a.append(d)
# a.append(j)
# a.append(m)
# print(a)


# a=('pop','append','slice')
# print(a[0])
# print(a[1])
# print(a[2])

# a=['str',5,99.0,True,('tuple','list')]
# print(a)

# a=['kanykey','eliza','azamat','saida','nurbek']
# b=''.join(a)
# print(b)

# a=['kanykey','eliza','azamat','saida','nurbek']
# b=('pop','append','slice')
# a.extend(b)
# print(a)


# names = ['Jack', 'Jimmy', 'Jackson', 'Jhon', 'Jackson', 'Jhon',  'Jimmy', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon',]
# print(names.count('Jack'))
# names.remove('Jack')
# print(names)


# me=[]
# me.append('Kanykey')
# me.append(2003)
# me.append('Python')
# print(me)

# pythonList = ["int", "str", "bool", "if", "else", "elif", "loop", "tuple", "list", "None", True, False]
# print(pythonList.index('loop'))
# a=pythonList.pop(6)
# print(pythonList)

# numbers = [123, 321, 2, 543, 64, 463, 234, 867, 6234, 63246, 3, 43]
# rez=1
# for i in numbers:
#     rez*=i
# print(rez)


names = ['Jack', 'Jimmy', 'Jackson', 9, 'Jackson', 'Jhon',  77, 'Jackson', 'Jhon',98576, 'Jimmy', 'Jack', 'Jackson', 984569, 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 74567, 'Jhon',]
# numbers=[]
# letters=[]

# for i in names:
#     if i :
#         print(i)
#     else:
#         print('lol')



#######################
# # Лист №1:
# names = ['Jack', 'Jimmy', 'Jackson', 'Jhon', 'Jackson', 'Jhon',  'Jimmy', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon',]

# Задача 1
# Есть список:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# Выведите все элементы, которые больше 5.
# for i in a:
#     if i>5:
#         print(i)

#Задача 2
# Есть набор чисел 
# digits = (113,118,-5,1,135,137,0,142,144,17,154,0,155,2,159,172)
# Поделить каждое число из digits на 9 и вывести на экран.
# for i in digits:
#     print(i/9)

#Задача 3
# fruits = ('banana','stawberry','apple','orange','limon','ananas')
# Выведите первый и последний элемент списка.


# Задача 4 
# Здесь замешаны разные типы данных. Если вы уверены что логика написана правильно, но оно всё равно не работает скорее всего вы справились с заданием
# Напишите программу, которая берёт массив данных spisok2 и выводит только те элементы из spisok_2, которых нет в spisok_1.
# spisok_1 = ('Lamborgini', 17, '4456', 2020, 'Paris', 'USA', 11, 23)
# spisok_2 = ('Ferrari', 17, 4456, 2021, 'Paris', 'UK', 777, 23)
# for i in spisok_2:
#     if i != spisok_1:
#         print(i)

# Задача 5
# Напишите программу, которая выводит чётные числа из списка длиною 300 объектов
#    и останавливается, если встречает число 237.

###################################################################LIST №3

# numbers = [123, 321, 2, 543, 64, 463, 234, 867, 6234, 63246, 3, 43]
#################################################################LIST №2
# pythonList = ["int", "str", "bool", "if", "else", "elif", "loop", "tuple", "list", "None", True, False]
# ~

# Задание 6:
# Дан список  целых чисел:
# numbers = [0,2,4,7,1,8,0,-3,7,0,-2,4,0,0,-1,7,-43,0,8,-3,6,9]
# Создайте новый лист и замените отрицательные числа на -1, положительные на число 1, ноль оставить без изменения.


# ################################################################################
# # Практические задания: Tuples and Lists
# ################################################################################
# # Лист №1:
# names = ['Jack', 'Jimmy', 'Jackson', 'Jhon', 'Jackson', 'Jhon',  'Jimmy', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon',]


# Задача 1
# Есть список:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# Выведите все элементы, которые больше 5.

#Задача 2
# Есть набор чисел 
# digits = (113,118,-5,1,135,137,0,142,144,17,154,0,155,2,159,172)
# Поделить каждое число из digits на 9 и вывести на экран.


#Задача 3
# fruits = ('banana','stawberry','apple','orange','limon','ananas')
# Выведите первый и последний элемент списка.

# Задача 4 
# Здесь замешаны разные типы данных. Если вы уверены что логика написана правильно, но оно всё равно не работает скорее всего вы справились с заданием
# Напишите программу, которая берёт массив данных spisok2 и выводит только те элементы из spisok_2, которых нет в spisok_1.
# spisok_1 = ('Lamborgini', 17, '4456', 2020, 'Paris', 'USA', 11, 23)
# spisok_2 = ('Ferrari', 17, 4456, 2021, 'Paris', 'UK', 777, 23)

# Задача 5
# Напишите программу, которая выводит чётные числа из списка длиною 300 объектов
#    и останавливается, если встречает число 237.


###################################################################LIST №3

# pythonList = ["int", "str", "bool", "if", "else", "elif", "loop", "tuple", "list", "None", True, False]

# Задание 6:
# Дан список  целых чисел:
# numbers = [0,2,4,7,1,8,0,-3,7,0,-2,4,0,0,-1,7,-43,0,8,-3,6,9]